tutorials/heatTransfer/chtMultiRegionFoamExt/parallelGasFlow/constant/bottomAir/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/bottomAir/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    minX
    {
        type            patch;
        nFaces          40;
        startFace       3140;
    }
    maxX
    {
        type            patch;
        nFaces          40;
        startFace       3180;
    }
    minY
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       3220;
    }
    minZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       3520;
    }
    maxZ
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       3640;
    }
    bottomAir_to_solid
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          300;
        startFace       3760;
        sampleMode      nearestPatchFace;
        sampleRegion    solid;
        samplePatch     solid_to_bottomAir;
    }
)

// ************************************************************************* //
