tutorials/heatTransfer/chtMultiRegionFoamExt/parallelGasFlow/constant/solid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     0.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/solid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


6
(
    minX
    {
        type            patch;
        nFaces          20;
        startFace       1420;
    }

    maxX
    {
        type            patch;
        nFaces          20;
        startFace       1440;
    }

    minZ
    {
        type            patch;
        inGroups        1 ( wall );
        nFaces          60;
        startFace       1460;
    }

    maxZ
    {
        type            patch;
        inGroups        1 ( wall );
        nFaces          60;
        startFace       1520;
    }

    solid_to_topAir
    {
        type            mappedWall;
        inGroups        1 ( wall );
        nFaces          300;
        startFace       1580;
        sampleMode      nearestPatchFace;
        sampleRegion    topAir;
        samplePatch     topAir_to_solid;
    }

    solid_to_bottomAir
    {
        type            mappedWall;
        inGroups        1 ( wall );
        nFaces          300;
        startFace       1880;
        sampleMode      nearestPatchFace;
        sampleRegion    bottomAir;
        samplePatch     bottomAir_to_solid;
    }

)


// ************************************************************************* //
