tutorials/heatTransfer/chtMultiRegionFoamExt/parallelGasFlow/0/solid/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/solid";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    minX
    {
        type            calculated;
        value           uniform 100000;
    }
    maxX
    {
        type            calculated;
        value           uniform 100000;
    }
    minZ
    {
        type            calculated;
        value           uniform 100000;
    }
    maxZ
    {
        type            calculated;
        value           uniform 100000;
    }
    solid_to_topAir
    {
        type            calculated;
        value           uniform 0;
    }
    solid_to_bottomAir
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
