tutorials/heatTransfer/chtMultiRegionFoamExt/parallelGasFlow/0/topAir/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/topAir";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 100000;

boundaryField
{
    maxY
    {
        type            calculated;
        value           uniform 100000;
    }
    minX
    {
        type            calculated;
        value           uniform 100000;
    }
    maxX
    {
        type            calculated;
        value           uniform 100000;
    }
    minZ
    {
        type            calculated;
        value           uniform 100000;
    }
    maxZ
    {
        type            calculated;
        value           uniform 100000;
    }
    topAir_to_solid
    {
        type            calculated;
        value           uniform 100000;
    }
}


// ************************************************************************* //
