tutorials/heatTransfer/chtMultiRegionFoamExt/parallelGasFlow/0/bottomAir/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/bottomAir";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 320;

boundaryField
{
    minX
    {
        type            fixedValue;
        value           uniform 320;
    }
    maxX
    {
        type            inletOutlet;
        value           uniform 320;
        inletValue      uniform 320;
    }
    minY
    {
        type            zeroGradient;
        value           uniform 300;
    }
    minZ
    {
        type            zeroGradient;
        value           uniform 300;
    }
    maxZ
    {
        type            zeroGradient;
        value           uniform 300;
    }
    bottomAir_to_solid
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 320;
        Tnbr            T;
        kappaMethod     fluidThermo;
    }
}


// ************************************************************************* //
