tutorials/heatTransfer/chtMultiRegionFoamExt/parallelGasFlow/0/solid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/solid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    minX
    {
        type            zeroGradient;
        value           uniform 300;
    }
    maxX
    {
        type            zeroGradient;
        value           uniform 300;
    }
    minZ
    {
        type            zeroGradient;
        value           uniform 300;
    }
    maxZ
    {
        type            zeroGradient;
        value           uniform 300;
    }
    solid_to_topAir
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 300;
        Tnbr            T;
        kappaMethod     solidThermo;
    }
    solid_to_bottomAir
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 300;
        Tnbr            T;
        kappaMethod     solidThermo;
    }
}


// ************************************************************************* //
