tutorials/heatTransfer/chtMultiRegionFoamExt/parallelGasFlow/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // solid
    {
        name    solidCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-100 -0.01001 -100 )(100 0.00999 100);
        }
    }
    {
        name    solid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set solidCellSet;
        }
    }

    // topAir
    {
        name    topAirCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-100 0.00999 -100 )(100 100 100);
        }
    }
    {
        name    topAir;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set topAirCellSet;
        }
    }


    // bottomAir is all the other cells
    {
        name    bottomAirCellSet;
        type    cellSet;
        action  new;
        source  cellToCell;
        sourceInfo
        {
            set solidCellSet;
        }
    }
    {
        name    bottomAirCellSet;
        type    cellSet;
        action  add;
        source  cellToCell;
        sourceInfo
        {
            set topAirCellSet;
        }
    }
    {
        name    bottomAirCellSet;
        type    cellSet;
        action  invert;
    }
    {
        name    bottomAir;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set bottomAirCellSet;
        }
    }
);


// ************************************************************************* //
